espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/jpeg_eco5_struct.h
/** Type of t0qnr register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** t0_qnr_val : HRO; bitpos: [31:0]; default: 0;
         *  write this reg to configure 64 quantization coefficient in t0 table
         */
        uint32_t t0_qnr_val:32;
    };
    uint32_t val;
} jpeg_t0qnr_reg_t;

/** Type of t1qnr register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** t1_qnr_val : HRO; bitpos: [31:0]; default: 0;
         *  write this reg to configure 64 quantization coefficient in t1 table
         */
        uint32_t t1_qnr_val:32;
    };
    uint32_t val;
} jpeg_t1qnr_reg_t;

/** Type of t2qnr register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** t2_qnr_val : HRO; bitpos: [31:0]; default: 0;
         *  write this reg to configure 64 quantization coefficient in t2 table
         */
        uint32_t t2_qnr_val:32;
    };
    uint32_t val;
} jpeg_t2qnr_reg_t;

/** Type of t3qnr register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** t3_qnr_val : HRO; bitpos: [31:0]; default: 0;
         *  write this reg to configure 64 quantization coefficient in t3 table
         */
        uint32_t t3_qnr_val:32;
    };
    uint32_t val;
} jpeg_t3qnr_reg_t;

/** Type of decode_conf register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** restart_interval : R/W; bitpos: [15:0]; default: 0;
         *  configure restart interval in DRI marker when decode
         */
        uint32_t restart_interval:16;
        /** component_num : R/W; bitpos: [23:16]; default: 3;
         *  configure number of components in frame when decode
         */
        uint32_t component_num:8;
        /** sw_dht_en : RO; bitpos: [24]; default: 1;
         *  software decode dht table enable
         */
        uint32_t sw_dht_en:1;
        /** sos_check_byte_num : R/W; bitpos: [26:25]; default: 3;
         *  Configure the byte number to check next sos marker in the multi-scan picture after
         *  one scan is decoded down. The real check number is reg_sos_check_byte_num+1
         */
        uint32_t sos_check_byte_num:2;
        /** rst_check_byte_num : R/W; bitpos: [28:27]; default: 3;
         *  Configure the byte number to check next rst marker after one rst interval is
         *  decoded down. The real check number is reg_rst_check_byte_num+1
         */
        uint32_t rst_check_byte_num:2;
        /** multi_scan_err_check : R/W; bitpos: [29]; default: 0;
         *  reserved for decoder
         */
        uint32_t multi_scan_err_check:1;
        /** dezigzag_ready_ctl : R/W; bitpos: [30]; default: 1;
         *  reserved for decoder
         */
        uint32_t dezigzag_ready_ctl:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} jpeg_decode_conf_reg_t;

/** Type of c0 register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** c0_dqt_tbl_sel : R/W; bitpos: [7:0]; default: 0;
         *  choose  c0 quntization table id (TBD)
         */
        uint32_t c0_dqt_tbl_sel:8;
        /** c0_y_factor : R/W; bitpos: [11:8]; default: 1;
         *  vertical sampling factor of c0
         */
        uint32_t c0_y_factor:4;
        /** c0_x_factor : R/W; bitpos: [15:12]; default: 1;
         *  horizontal sampling factor of c0
         */
        uint32_t c0_x_factor:4;
        /** c0_id : R/W; bitpos: [23:16]; default: 0;
         *  the identifier of c0
         */
        uint32_t c0_id:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} jpeg_c0_reg_t;

/** Type of c1 register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** c1_dqt_tbl_sel : R/W; bitpos: [7:0]; default: 0;
         *  choose  c1 quntization table id (TBD)
         */
        uint32_t c1_dqt_tbl_sel:8;
        /** c1_y_factor : R/W; bitpos: [11:8]; default: 1;
         *  vertical sampling factor of c1
         */
        uint32_t c1_y_factor:4;
        /** c1_x_factor : R/W; bitpos: [15:12]; default: 1;
         *  horizontal sampling factor of c1
         */
        uint32_t c1_x_factor:4;
        /** c1_id : R/W; bitpos: [23:16]; default: 0;
         *  the identifier of c1
         */
        uint32_t c1_id:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} jpeg_c1_reg_t;

/** Type of c2 register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** c2_dqt_tbl_sel : R/W; bitpos: [7:0]; default: 0;
         *  choose  c2 quntization table id (TBD)
         */
        uint32_t c2_dqt_tbl_sel:8;
        /** c2_y_factor : R/W; bitpos: [11:8]; default: 1;
         *  vertical sampling factor of c2
         */
        uint32_t c2_y_factor:4;
        /** c2_x_factor : R/W; bitpos: [15:12]; default: 1;
         *  horizontal sampling factor of c2
         */
        uint32_t c2_x_factor:4;
        /** c2_id : R/W; bitpos: [23:16]; default: 0;
         *  the identifier of c2
         */
        uint32_t c2_id:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} jpeg_c2_reg_t;

/** Type of c3 register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** c3_dqt_tbl_sel : R/W; bitpos: [7:0]; default: 0;
         *  choose  c3 quntization table id (TBD)
         */
        uint32_t c3_dqt_tbl_sel:8;
        /** c3_y_factor : R/W; bitpos: [11:8]; default: 1;
         *  vertical sampling factor of c3
         */
        uint32_t c3_y_factor:4;
        /** c3_x_factor : R/W; bitpos: [15:12]; default: 1;
         *  horizontal sampling factor of c3
         */
        uint32_t c3_x_factor:4;
        /** c3_id : R/W; bitpos: [23:16]; default: 0;
         *  the identifier of c3
         */
        uint32_t c3_id:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} jpeg_c3_reg_t;

/** Type of dht_info register
 *  Control and configuration registers
 */
typedef union {
    struct {
        /** dc0_dht_id : R/W; bitpos: [3:0]; default: 0;
         *  configure dht dc table 0 id
         */
        uint32_t dc0_dht_id:4;
        /** dc1_dht_id : R/W; bitpos: [7:4]; default: 1;
         *  configure dht dc table 1 id
         */
        uint32_t dc1_dht_id:4;
        /** ac0_dht_id : R/W; bitpos: [11:8]; default: 0;
         *  configure dht ac table 0 id
         */
        uint32_t ac0_dht_id:4;
        /** ac1_dht_id : R/W; bitpos: [15:12]; default: 1;
         *  configure dht ac table 1 id
         */
        uint32_t ac1_dht_id:4;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} jpeg_dht_info_reg_t;


/** Group: Interrupt registers */
/** Type of int_raw register
 *  Interrupt raw registers
 */
typedef union {
    struct {
        /** done_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  This raw interrupt bit turns to high level when JPEG finishes encoding a picture..
         */
        uint32_t done_int_raw:1;
        /** rle_parallel_err_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit to sign that rle parallel error when decoding.
         */
        uint32_t rle_parallel_err_int_raw:1;
        /** cid_err_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit to sign that scan id check with component fails when decoding.
         */
        uint32_t cid_err_int_raw:1;
        /** c_dht_dc_id_err_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit to sign that scan component's dc dht id check with dc dht
         *  table's id fails when decoding.
         */
        uint32_t c_dht_dc_id_err_int_raw:1;
        /** c_dht_ac_id_err_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit to sign that scan component's ac dht id check with ac dht
         *  table's id fails when decoding.
         */
        uint32_t c_dht_ac_id_err_int_raw:1;
        /** c_dqt_id_err_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit to sign that scan component's dqt id check with dqt table's
         *  id fails when decoding.
         */
        uint32_t c_dqt_id_err_int_raw:1;
        /** rst_uxp_err_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit to sign that RST header marker is detected but restart
         *  interval is 0 when decoding.
         */
        uint32_t rst_uxp_err_int_raw:1;
        /** rst_check_none_err_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit to sign that RST header marker is not detected but restart
         *  interval is not 0 when decoding.
         */
        uint32_t rst_check_none_err_int_raw:1;
        /** rst_check_pos_err_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit to sign that RST header marker position mismatches with
         *  restart interval when decoding.
         */
        uint32_t rst_check_pos_err_int_raw:1;
        /** out_eof_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit turns to high level when the last pixel of one square has
         *  been transmitted for Tx channel.
         */
        uint32_t out_eof_int_raw:1;
        /** sr_color_mode_err_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt bit to sign that the selected source color mode is not supported.
         */
        uint32_t sr_color_mode_err_int_raw:1;
        /** dct_done_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt bit to sign that one dct calculation is finished.
         */
        uint32_t dct_done_int_raw:1;
        /** bs_last_block_eof_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt bit to sign that the coding process for last block is finished.
         */
        uint32_t bs_last_block_eof_int_raw:1;
        /** scan_check_none_err_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw interrupt bit to sign that SOS header marker is not detected but there are
         *  still components left to be decoded.
         */
        uint32_t scan_check_none_err_int_raw:1;
        /** scan_check_pos_err_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  The raw interrupt bit to sign that SOS header marker position wrong when decoding.
         */
        uint32_t scan_check_pos_err_int_raw:1;
        /** uxp_det_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  The raw interrupt bit to sign that unsupported header marker is detected when
         *  decoding.
         */
        uint32_t uxp_det_int_raw:1;
        /** en_frame_eof_err_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  The raw interrupt bit to sign that received pixel blocks are smaller than expected
         *  when encoding.
         */
        uint32_t en_frame_eof_err_int_raw:1;
        /** en_frame_eof_lack_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  The raw interrupt bit to sign that the frame eof sign bit from dma input is missing
         *  when encoding. But the number of pixel blocks is enough.
         */
        uint32_t en_frame_eof_lack_int_raw:1;
        /** de_frame_eof_err_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  The raw interrupt bit to sign that decoded blocks are smaller than expected when
         *  decoding.
         */
        uint32_t de_frame_eof_err_int_raw:1;
        /** de_frame_eof_lack_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  The raw interrupt bit to sign that the either frame eof from dma input or eoi
         *  marker is missing when encoding. But the number of decoded blocks is enough.
         */
        uint32_t de_frame_eof_lack_int_raw:1;
        /** sos_unmatch_err_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  The raw interrupt bit to sign that the component number of a scan is 0 or does not
         *  match the sos marker's length when decoding.
         */
        uint32_t sos_unmatch_err_int_raw:1;
        /** marker_err_fst_scan_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  The raw interrupt bit to sign that the first scan has header marker error when
         *  decoding.
         */
        uint32_t marker_err_fst_scan_int_raw:1;
        /** marker_err_other_scan_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  The raw interrupt bit to sign that the following scans but not the first scan have
         *  header marker error when decoding.
         */
        uint32_t marker_err_other_scan_int_raw:1;
        /** undet_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  The raw interrupt bit to sign that JPEG format is not detected at the eof data of a
         *  packet when decoding.
         */
        uint32_t undet_int_raw:1;
        /** decode_timeout_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  The raw interrupt bit to sign that decode pause time is longer than the setting
         *  decode timeout time when decoding.
         */
        uint32_t decode_timeout_int_raw:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} jpeg_int_raw_reg_t;

/** Type of int_ena register
 *  Interrupt enable registers
 */
typedef union {
    struct {
        /** done_int_ena : R/W; bitpos: [0]; default: 0;
         *  This enable interrupt bit turns to high level when JPEG finishes encoding a
         *  picture..
         */
        uint32_t done_int_ena:1;
        /** rle_parallel_err_int_ena : R/W; bitpos: [1]; default: 0;
         *  The enable interrupt bit to sign that rle parallel error when decoding.
         */
        uint32_t rle_parallel_err_int_ena:1;
        /** cid_err_int_ena : R/W; bitpos: [2]; default: 0;
         *  The enable interrupt bit to sign that scan id check with component fails when
         *  decoding.
         */
        uint32_t cid_err_int_ena:1;
        /** c_dht_dc_id_err_int_ena : R/W; bitpos: [3]; default: 0;
         *  The enable interrupt bit to sign that scan component's dc dht id check with dc dht
         *  table's id fails when decoding.
         */
        uint32_t c_dht_dc_id_err_int_ena:1;
        /** c_dht_ac_id_err_int_ena : R/W; bitpos: [4]; default: 0;
         *  The enable interrupt bit to sign that scan component's ac dht id check with ac dht
         *  table's id fails when decoding.
         */
        uint32_t c_dht_ac_id_err_int_ena:1;
        /** c_dqt_id_err_int_ena : R/W; bitpos: [5]; default: 0;
         *  The enable interrupt bit to sign that scan component's dqt id check with dqt
         *  table's id fails when decoding.
         */
        uint32_t c_dqt_id_err_int_ena:1;
        /** rst_uxp_err_int_ena : R/W; bitpos: [6]; default: 0;
         *  The enable interrupt bit to sign that RST header marker is detected but restart
         *  interval is 0 when decoding.
         */
        uint32_t rst_uxp_err_int_ena:1;
        /** rst_check_none_err_int_ena : R/W; bitpos: [7]; default: 0;
         *  The enable interrupt bit to sign that RST header marker is not detected but restart
         *  interval is not 0 when decoding.
         */
        uint32_t rst_check_none_err_int_ena:1;
        /** rst_check_pos_err_int_ena : R/W; bitpos: [8]; default: 0;
         *  The enable interrupt bit to sign that RST header marker position mismatches with
         *  restart interval when decoding.
         */
        uint32_t rst_check_pos_err_int_ena:1;
        /** out_eof_int_ena : R/W; bitpos: [9]; default: 0;
         *  The enable interrupt bit turns to high level when the last pixel of one square has
         *  been transmitted for Tx channel.
         */
        uint32_t out_eof_int_ena:1;
        /** sr_color_mode_err_int_ena : R/W; bitpos: [10]; default: 0;
         *  The enable interrupt bit to sign that the selected source color mode is not
         *  supported.
         */
        uint32_t sr_color_mode_err_int_ena:1;
        /** dct_done_int_ena : R/W; bitpos: [11]; default: 0;
         *  The enable interrupt bit to sign that one dct calculation is finished.
         */
        uint32_t dct_done_int_ena:1;
        /** bs_last_block_eof_int_ena : R/W; bitpos: [12]; default: 0;
         *  The enable interrupt bit to sign that the coding process for last block is finished.
         */
        uint32_t bs_last_block_eof_int_ena:1;
        /** scan_check_none_err_int_ena : R/W; bitpos: [13]; default: 0;
         *  The enable interrupt bit to sign that SOS header marker is not detected but there
         *  are still components left to be decoded.
         */
        uint32_t scan_check_none_err_int_ena:1;
        /** scan_check_pos_err_int_ena : R/W; bitpos: [14]; default: 0;
         *  The enable interrupt bit to sign that SOS header marker position wrong when
         *  decoding.
         */
        uint32_t scan_check_pos_err_int_ena:1;
        /** uxp_det_int_ena : R/W; bitpos: [15]; default: 0;
         *  The enable interrupt bit to sign that unsupported header marker is detected when
         *  decoding.
         */
        uint32_t uxp_det_int_ena:1;
        /** en_frame_eof_err_int_ena : R/W; bitpos: [16]; default: 0;
         *  The enable interrupt bit to sign that received pixel blocks are smaller than
         *  expected when encoding.
         */
        uint32_t en_frame_eof_err_int_ena:1;
        /** en_frame_eof_lack_int_ena : R/W; bitpos: [17]; default: 0;
         *  The enable interrupt bit to sign that the frame eof sign bit from dma input is
         *  missing when encoding. But the number of pixel blocks is enough.
         */
        uint32_t en_frame_eof_lack_int_ena:1;
        /** de_frame_eof_err_int_ena : R/W; bitpos: [18]; default: 0;
         *  The enable interrupt bit to sign that decoded blocks are smaller than expected when
         *  decoding.
         */
        uint32_t de_frame_eof_err_int_ena:1;
        /** de_frame_eof_lack_int_ena : R/W; bitpos: [19]; default: 0;
         *  The enable interrupt bit to sign that the either frame eof from dma input or eoi
         *  marker is missing when encoding. But the number of decoded blocks is enough.
         */
        uint32_t de_frame_eof_lack_int_ena:1;
        /** sos_unmatch_err_int_ena : R/W; bitpos: [20]; default: 0;
         *  The enable interrupt bit to sign that the component number of a scan is 0 or does
         *  not match the sos marker's length when decoding.
         */
        uint32_t sos_unmatch_err_int_ena:1;
        /** marker_err_fst_scan_int_ena : R/W; bitpos: [21]; default: 0;
         *  The enable interrupt bit to sign that the first scan has header marker error when
         *  decoding.
         */
        uint32_t marker_err_fst_scan_int_ena:1;
        /** marker_err_other_scan_int_ena : R/W; bitpos: [22]; default: 0;
         *  The enable interrupt bit to sign that the following scans but not the first scan
         *  have header marker error when decoding.
         */
        uint32_t marker_err_other_scan_int_ena:1;
        /** undet_int_ena : R/W; bitpos: [23]; default: 0;
         *  The enable interrupt bit to sign that JPEG format is not detected at the eof data
         *  of a packet when decoding.
         */
        uint32_t undet_int_ena:1;
        /** decode_timeout_int_ena : R/W; bitpos: [24]; default: 0;
         *  The enable interrupt bit to sign that decode pause time is longer than the setting
         *  decode timeout time when decoding.
         */
        uint32_t decode_timeout_int_ena:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} jpeg_int_ena_reg_t;

