espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/jpeg_eco5_struct.h
typedef struct {
    volatile jpeg_config_reg_t config;
    volatile jpeg_dqt_info_reg_t dqt_info;
    volatile jpeg_pic_size_reg_t pic_size;
    volatile jpeg_extd_config_reg_t extd_config;
    volatile jpeg_t0qnr_reg_t t0qnr;
    volatile jpeg_t1qnr_reg_t t1qnr;
    volatile jpeg_t2qnr_reg_t t2qnr;
    volatile jpeg_t3qnr_reg_t t3qnr;
    volatile jpeg_decode_conf_reg_t decode_conf;
    volatile jpeg_c0_reg_t c0;
    volatile jpeg_c1_reg_t c1;
    volatile jpeg_c2_reg_t c2;
    volatile jpeg_c3_reg_t c3;
    volatile jpeg_dht_info_reg_t dht_info;
    volatile jpeg_int_raw_reg_t int_raw;
    volatile jpeg_int_ena_reg_t int_ena;
    volatile jpeg_int_st_reg_t int_st;
    volatile jpeg_int_clr_reg_t int_clr;
    volatile jpeg_status0_reg_t status0;
    volatile jpeg_status2_reg_t status2;
    volatile jpeg_status3_reg_t status3;
    volatile jpeg_status4_reg_t status4;
    volatile jpeg_dht_totlen_dc0_reg_t dht_totlen_dc0;
    volatile jpeg_dht_val_dc0_reg_t dht_val_dc0;
    volatile jpeg_dht_totlen_ac0_reg_t dht_totlen_ac0;
    volatile jpeg_dht_val_ac0_reg_t dht_val_ac0;
    volatile jpeg_dht_totlen_dc1_reg_t dht_totlen_dc1;
    volatile jpeg_dht_val_dc1_reg_t dht_val_dc1;
    volatile jpeg_dht_totlen_ac1_reg_t dht_totlen_ac1;
    volatile jpeg_dht_val_ac1_reg_t dht_val_ac1;
    volatile jpeg_dht_codemin_dc0_reg_t dht_codemin_dc0;
    volatile jpeg_dht_codemin_ac0_reg_t dht_codemin_ac0;
    volatile jpeg_dht_codemin_dc1_reg_t dht_codemin_dc1;
    volatile jpeg_dht_codemin_ac1_reg_t dht_codemin_ac1;
    volatile jpeg_decoder_status0_reg_t decoder_status0;
    volatile jpeg_decoder_status1_reg_t decoder_status1;
    volatile jpeg_decoder_status2_reg_t decoder_status2;
    volatile jpeg_decoder_status3_reg_t decoder_status3;
    volatile jpeg_decoder_status4_reg_t decoder_status4;
    volatile jpeg_decoder_status5_reg_t decoder_status5;
    volatile jpeg_status5_reg_t status5;
    volatile jpeg_eco_low_reg_t eco_low;
    volatile jpeg_eco_high_reg_t eco_high;
    uint32_t reserved_0ac[19];
    volatile jpeg_sys_reg_t sys;
    volatile jpeg_version_reg_t version;
} jpeg_dev_t;

extern jpeg_dev_t JPEG;

#ifndef __cplusplus
_Static_assert(sizeof(jpeg_dev_t) == 0x100, "Invalid size of jpeg_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
